'use strict';
/*
 * Цикли (while, do while, for)
 */

/*
 * While
 */

// while (condition) {
// код, тіло цикла (statement)
// }

// let iterator = 0;

// 0 < 5 = true
// 1 < 5 = true
// 2 < 5 = true
// 3 < 5 = true
// 4 < 5 = true
// 5 < 5 = false

// while (iterator < 5) {
//   console.log('iterator', iterator);
//   iterator = iterator + 1;
// }

/*
? Виведіть числа від 1 до 50
*/

// let num = 1;

/*
? Знайдіть суму чисел от 1 до 100
 */

// let number = 1;
// let result = 0;

/*
? Дано число n=1000.
?Ділить його на 2 стільки разів, поки результат розподілу не стане менше 50.
? Яке число вийде?
? Порахуйте кількість ітерацій, необхідних для цього, та запишіть його в змінну num.
*/

// let n = 1000;
// let counter = 0;

/*
 * Do While
 */
// do {
// statement
// } while (condition);

/*
? Напишіть цикл, який пропонує prompt ввести число більше 100.
? Якщо відвідувач ввів інше число – попросити ввести ще раз, і таке інше.
? Цикл повинен запитувати число, поки відвідувач не введе число, більше 100.
? Передбачається, що відвідувач вводить лише числа;
*/

// let number = null;

/*
 * For
 */
// for (ініціалізація; умова; пост-вираз) {
// тело цикла
// }

// for (let i = 0; i < 5; i += 1) {
//   console.log(i);
// }

/*
?За допомогою циклу for виведіть парні числа від 2 до 10.
*/

/*
? Напишіть програму, яка виводить через console.log усі числа від 1 до 100, з двома винятками.
? Для чисел, що націло діляться на 3, вона повинна виводити 'Fizz',
? а для чисел, що діляться на 5 – 'Buzz'.
? Для чисел які кратні 3 та 5 = 'FizzBuzz'
*/

/*
 ? Виведіть методом console.log() зірочки від 1 до 7 штук у вигляді трикутника таким чином:
 ? *
 ? **
 ? ***
 ? ****
 ? *****
 ? ******
 ? *******
 */

let star = '*';
